namespace EllepticCurveResultGeneration
{
    /// <summary> Генерация данных для анализа результатов работы алгоритма Ленстры </summary>
    internal class Program
    {
        public static void Main(string[] args)
        {
            // 1. нужен файл с числами, которые нужно факторизовать
            // 2. нужно несколько файлов для каждой размерности наименьшего делителя, чтобы иметь возможность регулировать количество 
            // 3. в программе нужно предусмотреть восстановление состояния для последующего выполнения программы
        }
    }
}